# Шарттуу операторлор (if, elif, else)
жаш = 18
if жаш < 18:
    print("Жашы жете элек.")
elif жаш == 18:
    print("18 жашта, паспорт ала алат.")
else:
    print("Жашы жеткен.")

# For цикли (тизме боюнча)
сандар = [1, 2, 3, 4, 5]
сумма = 0
for сан in сандар:
    сумма += сан
print(f"Сандардын суммасы: {сумма}")

# For цикли (range менен)
print("5ке чейинки сандар:")
for i in range(5): # 0дон 4кө чейин
    print(i)

# While цикли
эсептегич = 0
print("While цикли менен 3кө чейин саноо:")
while эсептегич < 3:
    print(эсептегич)
    эсептегич += 1